{
    "animals": [
      {
        "name": "Srilankan Jungle Fowl",
        "image": "./images/junglefowl.webp",
        "description":[
           "The male Sri Lankan junglefowl is much larger than the female, with more vivid plumage and a highly exaggerated wattle and comb. The male has orange-red body plumage and dark purple to black wings and tail. The feathers of the mane descending from head to base of the spine are golden, and the face has bare red skin and wattles. The comb is red with a yellow center. The male does not possess an eclipse plumage. The female has dull brown plumage with white patterning on the lower belly and breast, ideal camouflage for a nesting bird.",
          " Sri Lankan junglefowl are primarily terrestrial. They are typically active in the morning and in the evening and spend most of their time foraging for food. If disturbed Sri Lankan junglefowl take off to reach some cover for protection. They usually fly short distances but can fly longer distances in search of better food resources. At night these birds roost up in trees. They can roost singly, in pairs, or in small family groups. Sri Lankan junglefowl communicate with each other vocally. While foraging on the ground, the male utters some short calls ‘kreeu, kreeu, kreeuu’. It also utters high-pitched rooster-like crow ‘cor-cor-chow’ at dawn, often from a tree branch. The female gives some ‘kwikkuk, kwikkukkuk’. The male is more vocal during the breeding season with advertising calls and various sounds during displays, as well as the female with rivals and in territorial defense."
            ]
      },
      {
        "name": "PURPLE-FACED LANGUR",
        "image": "./images/langur.webp",
        "description":[
           "The purple-faced langur (Semnopithecus vetulus ), also known as the purple-faced leaf monkey, is a species of Old World monkey that is endemic to Sri Lanka. The animal is a long-tailed arboreal species, identified by a mostly brown appearance, dark face (with paler lower face) and a very shy nature. The species was once highly prevalent, found in suburban Colombo and the 'wet zone' villages (areas with high temperatures and high humidity).",
           " Purple-faced langurs are active during the day. They spend their lives in threes and are very territorial. Purple-faced langurs live in groups that usually consist of one adult male, up to 7 adult females, and their offspring of different ages. Some males live in bachelor groups that usually number from 2 to 14 individuals. Purple-faced langurs are very vocal and communicate with each other using various types of calls. Loud calls are often used to distinguish between individual langurs. These include harsh barks, whoops, and residuals. Calls occur more often in the morning mostly stimulated by neighboring groups and territorial battles. More calls occur during sunny periods than cloudy. The fewest calls occur in the evening. Daytime calls usually aid in the defense of home ranges. The loud barking call, particularly of the highland form, can be mistaken for the roar of a predator such as a leopard. Purple-faced langurs vocalize to alert members of predators, attract mates, defend territory and locate group members. Adult males are usually the most vocal among the entire group."
        ]
      },
      {
        "name": "SRI LANKA BLUE MAGPIE",
        "image": "./images/magpie.webp",
        "description":[
           "The Sri Lanka blue magpie measures 42–47 cm in length, and is larger than a mynah, but smaller than a crow, with a sturdy bill. Its plumage is bright blue, with a reddish-brown or chestnut head, neck, and wing. The blue tail is long and graduated, with a white tip. The bill, legs, feet, and featherless eye ring of this species are all vibrant red. Both the male and female of the species share this description. The juvenile of this species has a plumage similar to that of an adult, but overall duller, with a brown eye ring and a greyish hue to its blue feathers, especially on its underside. Moulting season for Sri Lanka blue magpies is from August to November.",
           " In spite of their avoidance of human-disturbed habitats, the Sri Lanka blue magpie tolerates and is even attracted to the presence of humans. In response to low and moderate levels of recreational disturbance, and small to medium-sized groups of human visitors, numbers of Sri Lanka blue magpies increased, unlike other birds. A group of individuals was often observed waiting near trails, expecting to be fed by groups of human visitors."
        ]
      },
      {
        "name": "SRI LANKAN HILL MYNA",
        "image": "./images/hill myna.webp",
        "description":[
           "The Sri Lanka hill myna, Ceylon myna or Sri Lanka myna (Gracula ptilogenys ), is a myna, a member of the starling family. This bird is endemic to Sri Lanka. This passerine is typically found in forest and cultivation. The Sri Lanka myna builds a nest in a hole. The normal clutch is two eggs. These 25 cm long birds have green-glossed black plumage, purple-tinged on the head and neck. There are large white wing patches, which are obvious in flight. The strong legs are bright yellow, and there are yellow wattles on the nape. The different shape and position of the wattles and the stouter orange-red bill distinguish this species from the Southern hill myna, which also occurs in Sri Lankan forests. The sexes are similar in plumage, but can be distinguished by iris color, which is pale in females and dark in males. Juveniles have a duller bill and smaller wattles, and are less glossy overall. Like most starlings, the Sri Lanka myna is fairly omnivorous, eating fruit, nectar and insects.",
           "In Sri Lanka, this bird is known in many names including Sela lihiniya, Mal kawadiya, Kampatiya in the Sinhala language. The name Sela Lihiniya is often mentioned in poems and other similar literature and is quoted for its melodious calls. This bird appears in a 10 rupee Sri Lankan postal stamp. It is also the media icon of Sri Lanka Rupavahini Corporation."
        ]
      },
      {
        "name": "RED-BACKED FLAMEBACK",
        "image": "./images/flameback.webp",
        "description":[
           "About 28 centimetres (11 in) in length. Mostly crimson with black trailing edges to wings. underparts white with messy black marks. The breast and neck are black with white spots on the throat and white streaks on the breast. A black eyestripe stretches to the back of the neck and diffuses into the nape and upper back, with white streaks between the eye and neck. It has a red crown, with the forecrown and forehead black speckled with white in females. The eye is hidden among the black eyestripe. It has a fairly sized grey bill, which forms a blunt point. Juveniles are duller with less bold markings, with males having white spots on crown and females with few spots if not none. Hybrids can be either mostly red with orange or yellow (closer to Red-backed flameback) or mostly yellow with red or orange (closer to Black-rumped flameback).",
           " It drills nest holes at many variable heights. These holes, which can only be built by woodpeckers, barbets and other Piciformes, are nesting sites for other cavity-nesting birds like parrots, who cannot make their own holes. Sometimes broods twice, but usually only one clutch is laid per season. It breeds from December-September, predominantly from August-September and from February-June. Two-three eggs are laid per clutch."
        ]
      },
      {
        "name": "TRIMERESURUS TRIGONOCEPHALUS",
        "image": "./images/trimeresurus.webp",
        "description":[
           "Craspedocephalus trigonocephalus is a sexually dimorphic, mid-sized, cylindrical species. These snakes measure 20–25 cm (7.9–9.8 in) at birth, and males grow to a maximum total length of 60–75 cm (24–30 in). The neck is distinct from the flattened, triangular head. There is a loreal pit on each side of the head. Mid-sized eyes and a short, rounded, broad snout are present. The males are considerably smaller than females, which can grow up to 130 cm (51 in) in total length. The ground color of the snake is variable and cryptic. Typically, it is a green snake with a black variegated pattern, and a black temporal line is usually present. The wet zone snakes have these black patterns more clearly marked. The vertebral area has a tinge of yellow. The tail is black. The ventral scales are light greenish-yellow or may even be grey. Some snakes have only the black temporal line and the black tail, with the rest of the body being green. In addition, males tend to have a blue coloration, whereas the females are predominantly green. These are bulky snakes with prehensile, short tails, suiting their arboreal lifestyle.",
           " It is arboreal and nocturnal, occasionally descending to the ground in search of food such as lizards, frogs, small mammals, and birds. This sluggish pit viper is usually encountered on low shrubs during morning hours, but it mostly occupies in grasslands and rain forests. In mornings, it is seen to stay on top of trees to obtain sun rays to heat its body. It uses its tail to hold on to a tree branch."
           ]
      },
      {
        "name": "SRI LANKAN KRAIT",
        "image": "./images/mudukarawala.webp",
        "description":[
           "The Sri Lankan krait is small and slender. On hatching, the length of the snake is about 250 mm (9.8 in). The average adult length for this species is 75 cm (29+1⁄2 in) with 90 cm (35+1⁄2 in) being the upper limit.Its black skin is crossed with thin white transverse bands. It has an extraordinarily long lung which it inflates when angry.",
           " The Sri Lankan krait is nocturnal and timid. It is very slow and sluggish by day. At night it may strike after considerable provocation, but behaves quite the contrary by day, often allowing itself to be handled or even bullied with impunity. During such rough treatment it usually does nothing but puff up its lung to display its discomfort."
           ]
      }
    ],
    "national_parks": [
      {
        "name": "YALA NATIONAL PARK",
        "image": "./images/67.jpg",
        "description": "Yala combines a strict nature reserve with a national park. Divided into 5 blocks, the park has a protected area of nearly 130,000 hectares of land consisting of light forests, scrubs, grasslands, tanks and lagoons. Two blocks are currently opened to the public.",
        "link": "yala.html"
      },
      {
        "name": "WILPATTU NATIONAL PARK",
        "image": "./images/wilpattup5.jpeg",
        "description": "Wilpattu National Park (WNP). Ranging over 131 thousand hectares, it is Sri Lanka’s largest and one of the oldest protected areas. The park consists of five blocks declared between 1938-1973 under the Fauna and Flora Protection Ordinance and is managed by the Department of  Wildlife Conservation.",
        "link": "wilpattu.html"
      }
    ]
  }
  